/**
 * 
 * @author user
 * 점수 발생 안내문구 추가!
 */
public class Obtained_Card {
	int[] card = new int[48];
	
	void userAdd(Card card){
		for(int i=0;i<48;i++) this.card[i] = card.card[i];
	}
	
	int computeScore(){
		final int[] gwang = {1,9,29,41,45};//광 데이터 리스트
		final int[] yeolkkeut = {5,13,17,21,25,30,37,46};//열끗 데이터 리스트
		final int[] okkeut = {2,6,10,14,18,22,26,34,38,46};//오끗 데이터 리스트
		final int[] p = {3,4,7,8,11,12,15,16,19,20,23,24,27,28,31,32,35,36,39,40,43,44,33,42,48};//피 데이터 리스트: 마지막 3개는 쌍피 +쌍피는 추후 추가 가능
		int score =0;
		int count=0;
//==============================================================================================	
		//광
		for(int i : gwang) //향상된 for문 사용 
		{
			if(card[i-1]==1) count++;
		}
		
		if(count==3) 
		{
			if(card[44]==1) score +=2; // 45번째 카드 : 배열은 0 부터 시작임으로 "-1" 해준 위치를 넣어야 한다.
			else score +=3;
		}
		if(count==4) score +=4;
			
		if(count==5) score += 15;		
//==============================================================================================
		//열끗
		count = 0;
		for(int i : yeolkkeut) //향상된 for문 사용 
		{
			if(card[i-1]==1) count++;
		}
		if(count>=3) //수정 고려
		{
			if(card[4]==1 && card[12]==1 && card[29]==1) score +=5; //고도리
		}
		if(count>=5) score+= (count%5+1);//5개부터 1점 이후 하나씩 늘어날때마다 1점씩 추가
//==============================================================================================
		//오끗
		count = 0;
		for(int i : okkeut) //향상된 for문 사용 
		{
			if(card[i-1]==1) count++;
		}
		
		if(count>=3)//청단,홍단,초단인 경우 //수정 고려
		{
			if(card[1]==1 && card[5]==1 && card[9]==1) score +=3; //홍단
			if(card[21]==1 && card[33]==1 && card[37]==1) score +=3;//청단
			if(card[13]==1 && card[17]==1 && card[25]==1) score +=3;//초단
			
		}
		if(count>=5) score+=(count-4);//5개부터 1점 이후 하나씩 늘어날때마다 1점씩 추가
//===============================================================================================		
		//피
		count = 0;
		for(int i : p) //향상된 for문 사용 
		{
			if(card[i-1]==1) 
			{ 	
				count++;
				if(i==33||i==42||i==48) count++;//쌍피는 카운트 하나 더
			}
		}
		if(count>=10) score += (count%10+1);
//==============================================================================================	
		
		return score;
	}

}
